[
  {
    "category": "Numbers & Bases",
    "joke": "Binary is like a language only computers understand; humans just get lost."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the computer cold? It left its Windows open."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are only 10 kinds of people: those who understand hexadecimal and those who don't."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer confuse Christmas and Halloween? Because DEC 25 = OCT 31."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the decimal cross the road? To get to base 2."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are 10 types of people: those who understand binary and those who don't."
  },
  {
    "category": "Numbers & Bases",
    "joke": "How do programmers count cows? 1, 10, 11… (binary counting)"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do hexadecimal numbers make bad roommates? Because they're always high-fiving (0xF)!"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the computer take a nap? It had too many bytes."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the computer tired when it got home? It had a hard drive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers love binary? It's as simple as 1, 0."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the integer break up with the float? Too many decimals."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why are octal numbers afraid of decimal? They don't want to be divided."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the array so sad? Its indexes were all over the place."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was 6 afraid of 7? Because 7 8 9… in binary."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do computers make terrible comedians? They can't handle negative feedback."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the coder get stuck in base 2? He couldn't find the decimal point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the byte go to therapy? It had 8 bits of emotional baggage."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite place to hang out? The Foo Bar."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the equal sign so humble? It knew it wasn't greater than or less than anyone else."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number go to school? To improve its base education."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a number that can't keep still? A roamin' numeral."
  },
  {
    "category": "Logic & Boolean",
    "joke": "If at first you don't succeed; call it version 1.0."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate spaces? Because they prefer tabs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A Boolean walks into a bar and says nothing, because it's false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers love logic gates? Because they know how to 'and' and 'or'."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Recursion is when a function calls itself, but only after reading the documentation."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the Boolean sad? Because it was always false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Programmers don't die; they just get garbage collected."
  },
  {
    "category": "Logic & Boolean",
    "joke": "To understand recursion, you must first understand recursion."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A Boolean walks into a bar. The bartender asks, 'Do you want a drink?' The Boolean replies, 'True.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "How many programmers does it take to change a light bulb? None. That's a hardware problem."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get stuck in the shower? The instructions said: Lather, Rinse, Repeat."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers prefer dark mode? Because light attracts bugs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the Boolean unhappy? Because it always had to choose True or False."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the function always sad? It had too many arguments."
  },
  {
    "category": "Logic & Boolean",
    "joke": "How do programmers celebrate success? With a logical high-five."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the coder go to therapy? Too many unresolved exceptions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate meetings? They prefer conditions without side effects."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the developer keep repeating himself? Recursion, of course."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the object-oriented way to become wealthy? Inheritance."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the Boolean go to the doctor? It wasn't feeling true to itself."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite hangout spot? The Foo Bar."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why don't programmers like nature documentaries? Too many race conditions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a programmer from Finland? Nerdic."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the function break up with the variable? It had commitment issues and kept changing."
  },
  {
    "category": "Coding & Git",
    "joke": "I told my Git to merge, but it still conflicts with my feelings."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer go broke? Because he used all his cache."
  },
  {
    "category": "Coding & Git",
    "joke": "Git commit -m 'fixes everything' never works, yet we try it anyway."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do Java developers wear glasses? Because they don't C#."
  },
  {
    "category": "Coding & Git",
    "joke": "I would tell you a joke about Git, but you might not 'merge' it well."
  },
  {
    "category": "Coding & Git",
    "joke": "A SQL query walks into a bar, walks up to two tables and asks: 'Can I join you?'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the function sad? It lost its closure."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the coder get stuck in the shower? He was caught in an infinite loop of shampooing."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer iOS development? Because Swift makes them fast."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer go broke at the restaurant? He forgot to close his table."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git break up with GitHub? Too many conflicts."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love version control? Because it keeps their mistakes documented."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the programmer afraid of the stairs? He couldn't handle recursion."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you comfort a JavaScript bug? Console it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do Python developers wear glasses? They can't C without them."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function refuse to work? It had too many dependencies."
  },
  {
    "category": "Coding & Git",
    "joke": "How do developers fix a broken website? They Ctrl+Z their mistakes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the code cold? Because it left its Windows open."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite song? 'Hello World' by Adele."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer get arrested? He was caught in an illegal operation."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who doesn't comment their code? An enemy of the state."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the Ruby developer go broke? Too many gems to buy."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of music? Algorithm and blues."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the CSS file feel lonely? It had no class."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a snake that writes code? Python."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer get kicked out of the library? Because he kept breaking the silence with exceptions."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the most used language in programming? Profanity."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers always mix up Thanksgiving and Christmas? Because Nov 25 = Dec 23."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers hate nature? Too many bugs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder get kicked out of school? He kept breaking class rules."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call 8 hobbits? A hobbyte."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are 3 kinds of people: Those who can count in ternary, those who can't, and those who didn't expect ternary."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Python programmer go hungry? Because he didn't import food."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the developer afraid of elevators? Because he couldn't handle the stack trace."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer's wife asks him to take out the trash; he gives her a Boolean answer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder get lost? He couldn't find the main() function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer always carry a map? To avoid infinite loops."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How do programmers cheer each other up? They console.log their feelings."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder stay calm during a fire? He used try…catch."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do developers love cookies? Because they always clear them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the computer go to art school? To improve its graphics."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer quit his job? He didn't get arrays."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer like Linux? Because he loved the terminal."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers love keyboards? Because they have all the keys to success."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the coder stressed? He had too many threads to manage."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer bring a ladder to work? To reach the top of the stack."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer cross the road? To get to the other IDE."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder break up with JavaScript? Too many callbacks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers hate bugs? Because they always crash the party."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer always carry a notebook? To keep track of his stack."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the database administrator sad? Too many relationships ended badly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder go to the beach? To surf the web."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers love pizza? Because it has all the right slices."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers always carry a towel? In case they need to dry their code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite dance? The algo-rhythm."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the AI go to school? To improve its neural networks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a group of security experts? A cypher."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the machine learning model so confident? It had high self-esteem and low bias."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a hacker's favorite season? Phishing season."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why don't programmers like to go outside? The graphics aren't as good."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What did the router say to the doctor? It hurts when IP."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the computer tired? It had a hard drive and needed to crash."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who doesn't use spaces or tabs? An anarchist."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the agile team go to therapy? Too many sprint retrospectives."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's least favorite holiday? Syntax Error Day."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the blockchain developer get in trouble? They kept making immutable mistakes."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call an algorithm that sings? An auto-tune function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the quantum computer so mysterious? It was in a superposition of working and broken."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite exercise? Running code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the DevOps engineer break up with their partner? Too many deployment issues."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a function that always returns true? An optimist."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why don't programmers like jokes about UDP? Because you never know if they get them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a programmer and a user? The programmer knows it's a feature, not a bug."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers get Halloween and Christmas confused? Because 31 OCT = 25 DEC."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite snack? Microchips."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the math book sad? It had too many problems and couldn't compile."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer floating in the ocean? A Dell rolling in the deep."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did zero break up with eight? She felt like he was just two-faced."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite beat? An algorithm."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the JavaScript developer sad? Because he didn't Node how to Express himself."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you get when you cross a computer with a lifeguard? A screensaver."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why don't computers ever get tired? They just take power naps."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What did the spider do on the computer? Made a website."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the computer so good at music? It had great bandwidth."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that sings? A-Dell."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the PowerPoint presentation cross the road? To get to the other slide."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's least favorite food? Spam."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers prefer hexadecimal? Because it's hex-cellent."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer's wife leave him? He kept saying 'It works on my machine.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite game? Hide and seek exception."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate the outdoors? Too many processes running in the background."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What did the Java code say to the C code? You've got no class."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the developer always calm? He knew how to handle exceptions gracefully."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of party? A Boolean bash - you're either in or out."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get stuck at the airport? The security kept saying 'Access Denied.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a programmer who doesn't comment code? Self-documenting... supposedly."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why don't programmers like to argue? They prefer to return null."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite horror movie? The NullPointerException."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the Boolean go to art class? To learn about true colors."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a function that won't stop talking? Verbose."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the loop go to the doctor? It was feeling a bit iteration."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the best thing about a Boolean? It's straightforward - no gray areas."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer fail at meditation? Couldn't empty his cache."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer get fired? He pushed to production on a Friday."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite breakfast? Java with some bytes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the PHP developer get stuck in a maze? They kept using GoTo."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who loves poetry? A code bard."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the Git repository so messy? Too many branches and not enough cleanup."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite movie? The Matrix - best debugging scene ever."
  },
  {
    "category": "Coding & Git",
    "joke": "Why don't programmers trust stairs? They're always up to something in increments."
  },
  {
    "category": "Coding & Git",
    "joke": "What did the HTML say to the CSS? I like your style."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the JavaScript function so emotional? It had too many callbacks to deal with."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite car? A Tesla - it has the best API."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer wear glasses to the code review? To C# better."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who works out? A buffer overflow."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the API so popular? It had great endpoints."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite drink? Java. Anything else would be grounds for dismissal."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer go to the bar? To get some REST."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer from Helsinki? Nerdic by nature."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the Git commit so emotional? It had attachment issues."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite magic spell? sudo make me a sandwich."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer always carry a pencil? In case they needed to draw the interface."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer who doesn't use Git? Lost."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the neural network go to therapy? It had too many layers of issues."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a hacker's favorite breakfast? Spam and encrypted eggs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the Docker container so lonely? It was isolated from the host."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a Kubernetes expert? A pod person."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the microservice break up with the monolith? It needed more independence."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite Shakespeare play? Much Ado About Null Thing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the regex so confident? It could match anything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a snake that's 3.14 meters long? A Python."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the compiler break up with the interpreter? It needed someone more committed."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite Star Wars character? R2-D2 - the ultimate debugging droid."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the hash table so organized? It knew where everything belonged."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who writes poetry? A code-et."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the blockchain developer become a philosopher? They were interested in distributed truth."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite constellation? The Cloud."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the assembly programmer always tired? They worked at such a low level."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a bug that's in production? A feature request waiting to happen."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the load balancer go to therapy? It couldn't handle the weight of its responsibilities."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite kind of tree? A binary search tree - perfectly balanced."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the encryption algorithm so secretive? It liked to keep things private."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a program that always tells the truth? Honest-ML."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the garbage collector feel unappreciated? Everyone just took it for granted."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite bedtime story? Goodnight Moon... and all the memory leaks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the TCP connection so reliable? It always acknowledged its packets."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call an optimistic optimizer? Someone who thinks O(n²) is fine."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the cloud architect bring an umbrella? In case of data rain."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the binary code feel incomplete? It was missing a bit."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite ice cream? Bit-terscotch."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the number system jealous of binary? Because binary got all the attention."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that's been in the sun too long? A hot spot."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the bit go to school? To become a byte."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite game? Disc golf."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the CPU so hot? It was processing too many flames online."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that tells dad jokes? A groan-up system."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the pixel go to therapy? It had resolution issues."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite animal? A RAM."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the hard drive always hungry? It had too many empty sectors."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a binary number that's always complaining? Bit-ter."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the octal number feel left out? Everyone was going decimal or hexadecimal."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite dessert? Apple pi."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the gigabyte so popular? It had a lot of presence."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer in a blizzard? A snow-flake server."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the bits throw a party? To celebrate their byte-day."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite pizza topping? Pepperoni with extra bytes."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the memory chip so forgetful? It needed more cache."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the if statement go to the gym? To work on its condition."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite exercise? Boolean jumps - true or false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the else statement feeling left out? It only got called when things went wrong."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a logical operator that can't make up its mind? XOR-dinary."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the switch statement throw a party? It had so many cases to celebrate."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic? Boolean algebra - it's either right or wrong."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the while loop so patient? It knew how to wait for the right condition."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a recursive joke? See: recursive joke."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the for loop get dizzy? It went around too many times."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite magic trick? Making bugs disappear with try-catch."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the exception handler so popular? Everyone needed it when things broke."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a condition that's always true? An optimist's dream."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the null value feel empty inside? Because it literally was."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite weather? Cloudy with a chance of exceptions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the return statement so final? It never looked back."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a program that never stops? An infinite optimist."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the break statement leave early? It couldn't handle the loop anymore."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite philosophy? If it compiles, it's true."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the continue statement so persistent? It never gave up on the loop."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a logical error? A contradiction in code."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer bring a broom to work? To clean up the code."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite dessert? Cookies with cache-ew nuts."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the GitHub repository so popular? It had great commit-ment."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who loves the ocean? A deep-sea diver into code."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the merge fail? It had too many conflicts to resolve."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite sport? Debugging hurdles."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the pull request so nervous? It was afraid of rejection."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a Git branch that never merges? A loner."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer love gardening? They were good at cherry-picking commits."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite dance move? The Git push."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the code review so harsh? The reviewer had no filter."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who never makes mistakes? A liar."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the IDE go to the doctor? It had too many extensions."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite season? Fall, because of all the stack traces."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the syntax highlighter so colorful? It loved to paint the code."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a bug that survives code review? A feature in disguise."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer refuse to play cards? They didn't want to deal with the deck."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite board game? Debugging Monopoly - where you never pass Go."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the linter so critical? It couldn't help but point out flaws."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer at a wedding? The one debugging the photo booth."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the distributed system feel scattered? It had nodes all over the place."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a hacker's favorite instrument? The key-board."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the virtual machine so confused? It didn't know if it was real or not."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a serverless function? A cloud nomad."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the AI feel existential? It questioned its own neural existence."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite philosophy book? Being and Nothingness - starring null."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the cache so fast? It remembered everything important."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a database that tells jokes? SQL-arious."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the NoSQL database rebel? It refused to follow the schema."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite workout? Lifting heavy queries."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the API gateway so busy? Everyone wanted to get through."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a machine learning model that's always wrong? Confidently incorrect."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the thread pool feel exhausted? Too many concurrent requests."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite superhero? Captain Async - always non-blocking."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the memory leak so sneaky? It slowly drained everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a pointer that doesn't point anywhere? Lost."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the packet get lost? Poor routing decisions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite martial art? Kung-Foo Bar."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the firewall so protective? It had trust issues."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a graph that's all connected? A social butterfly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the sorting algorithm feel pressured? It had to keep things in order."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of art? Abstract syntax trees."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the quantum bit so indecisive? It existed in multiple states."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a race condition? A photo finish you can't predict."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the mutex feel lonely? It only allowed one at a time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of tree? B-tree - perfectly balanced, as all things should be."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the deadlock so stubborn? Nobody would give up their resources."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a buffer that's always full? Over-achiever overflow."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the compiler optimizer feel proud? It made everything run faster."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite magic spell? Abracadabra - turn coffee into code."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the nibble feel inferior? It was only half a byte."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite snack at the movies? Micro-popcorn."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the kilobyte jealous of the megabyte? Size matters in storage."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that's always cold? A bit chilly."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the binary number go to the party alone? It couldn't find its complement."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite type of sandwich? A sub-routine."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the terabyte so impressive? It had storage presence."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a number that's good at sports? An ath-byte."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the hex number feel special? It was 0xFF-icionado."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite type of music? Heavy meta-data."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the unsigned integer always positive? It didn't know how to be negative."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer's autobiography? A blog."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the clock cycle feel rushed? It only had nanoseconds."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite candy? Bit-O-Honey."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the parity bit so balanced? It kept everything even."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that loves to travel? A laptop on the go."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the floating point feel unstable? Precision issues."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite game show? The Price is Float."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the signed integer so moody? It could be negative or positive."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer meditate? To find inner peace in outer loops."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a Boolean's favorite movie? True Lies."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the conditional statement indecisive? It had too many else-ifs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a loop that's always happy? A do-while smiling."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the nested loop feel claustrophobic? Too many layers."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite yoga pose? The infinite loop."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the AND gate so selective? Both conditions had to be true."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a logic gate that's always inclusive? OR-ganizer."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the NOT gate feel contrary? It flipped everything."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite bedtime? When the loops finally terminate."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the NAND gate so popular? It was universally useful."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a Boolean that can't decide? Null-ecisive."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the ternary operator feel efficient? It made quick decisions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic puzzle? Debugging production."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the assertion so confident? It stated facts boldly."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a condition that's never met? Wishful thinking."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the variable feel unstable? It kept changing its value."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite paradox? This statement is false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the constant so reliable? It never changed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a function that always returns? Responsible."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a chef? They loved working with cookies."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite type of humor? Dry wit with sarcastic comments."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the README file so helpful? It documented everything."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a Git stash that's full? A hoarder's paradise."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer love autumn? Perfect season for leaf nodes."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite breakfast cereal? Syntax Crunch."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the fork so independent? It went its own way."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a commit message that's unclear? A mystery novel."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer open a bakery? They were great at making cookies."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite type of pet? A watchdog process."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the rebase so controversial? It rewrote history."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer who loves gardening? Someone who prunes their Git tree."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer join a band? They wanted to play with arrays."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite Olympic sport? Synchronous swimming in async."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the package manager so organized? Everything in its right dependency."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer who loves fishing? Someone who debugs streams."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a detective? They loved to trace bugs."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite card game? Pair programming."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the diff so dramatic? It highlighted every change."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who never tests? Dangerously optimistic."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the semaphore feel important? It controlled access."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a hacker's favorite type of coffee? Espresso with a side of exploit."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the load balancer so fair? It distributed evenly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a containerized application? A Docker in a box."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the microservice feel small? It only did one thing well."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of poetry? Haiku comments in code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CDN so fast? It was always close to you."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a database transaction? A commit-ment issue."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the webhook feel reactive? It responded to every trigger."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite constellation? Orion's Belt... of tools."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the orchestration platform so bossy? It managed everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a developer who loves astronomy? A star schema designer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the CI/CD pipeline feel accomplished? It delivered continuously."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of garden? A data greenhouse."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the sharding strategy so divisive? It split everything up."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call an index that never helps? Useless overhead."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the message queue feel patient? It waited for consumers."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of sandwich? A layered architecture."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the REST API so relaxed? It followed a stateless lifestyle."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a GraphQL query? A data wish list."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the stream processor feel overwhelmed? Too much data flowing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of architecture? Micro-everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the event sourcing so nostalgic? It remembered everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a monorepo? A family that stays together."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the service mesh feel connected? It linked everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of therapy? Pair programming sessions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the edge computing so trendy? It was on the cutting edge."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a lambda function? A serverless wanderer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the time series database feel historical? It stored the past."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of relationship? Many-to-many with proper constraints."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer go to art school? To learn about color schemes."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite instrument? The pipeline organ."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the hotfix so urgent? Production was on fire."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer at the beach? Someone debugging in sandboxes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer love winter? Perfect time for frozen dependencies."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite board game? Risk - it's all about calculating odds."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the short-circuit feel lazy? It stopped at the first false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call logic that makes no sense? A bug feature."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the petabyte so expensive? Storage costs add up."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite type of math? Algorithm-etic."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the bit feel lonely? It was just a single unit."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite vegetable? Micro-greens in the cloud garden."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the exabyte so rare? Not many could afford it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that loves math? A calculator's big brother."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the ASCII character feel limited? Only 128 possibilities."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite fruit? Apple with Windows."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the Unicode so inclusive? It represented everyone."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a number system that's always partying? Base 16 - it's hex-static!"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the checksum feel responsible? It verified everything."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite sport? Bit-minton."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the little-endian so backwards? It started from the end."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a byte that's always happy? Opti-bit-stic."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the big-endian feel superior? It put the most significant first."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite vacation spot? Silicon Valley Beach."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the CRC so protective? It caught errors."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a computer that loves to dance? A disc-o drive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the zettabyte feel massive? It was truly huge."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite drink? Root beer - for the root directory."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the mantissa so precise? It handled the decimal part."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer practice mindfulness? To debug their thoughts."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a Boolean's favorite restaurant? True Food Kitchen."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the else-if ladder so long? Too many conditions to check."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a loop that never ends? A forever friend."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the NAND gate feel versatile? It could build anything."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite sport? Logic-ball."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the XOR gate so exclusive? Only one could be true."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a conditional that's always taken? The main path."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the do-while loop feel optimistic? It tried at least once."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite fruit? Logic-berries."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the foreach loop so friendly? It visited everyone."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a function with side effects? Unpredictable."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the pure function feel proud? No side effects ever."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite movie genre? Conditional drama."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the goto statement considered bad? It jumped to conclusions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a variable that never changes? Constantly consistent."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the tail recursion feel efficient? No stack overflow worries."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of joke? One with perfect timing."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the lazy evaluation so relaxed? It waited until needed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call a predicate that's always false? A pessimist."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a musician? They loved to compose functions."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite pizza? Deep dish with extra layers."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the changelog so detailed? It documented every journey."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a Git branch strategy? A tree of life."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer love spring? Time for spring cleaning the codebase."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite type of tea? Chai-thon."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the refactor so satisfying? Everything became cleaner."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a codebase with good tests? Well-covered."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a writer? They loved to script."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite holiday? Thanksgiving - time to deprecate old code."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the squash commit so tidy? It cleaned up the mess."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer who loves hiking? Someone who explores the tech stack."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer join the circus? They were great at juggling dependencies."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite dance? The merge waltz."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the blame command so accusatory? It pointed fingers."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer who loves cooking? A recipe scripter."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a pilot? They wanted to navigate through clouds."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite type of cheese? String cheese."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the bisect so helpful? It found the culprit commit."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who never commits? Commitment-phobic."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the consensus algorithm feel democratic? Everyone had to agree."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a hacker's favorite meal? Phishing and chips."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the replica set so reliable? Redundancy for safety."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a container orchestrator? The conductor of chaos."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the saga pattern feel epic? It told a distributed story."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite Shakespeare play? As You Await It."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the circuit breaker so protective? It prevented cascading failures."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a distributed transaction? A coordinated effort."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the rate limiter feel controlling? It throttled everything."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite planet? Mars - the god of WAR files."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the WAL so persistent? It logged everything first."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a developer who loves space? A cosmic coder."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the eventual consistency feel patient? It knew things would align."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite season? Spring - for Spring Boot."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CQRS pattern so organized? Reads and writes separated."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a perfect hash function? A dream come true."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the pub-sub pattern feel social? Everyone subscribed."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of bird? A Java sparrow."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the idempotent operation so safe? You could retry it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a bloom filter? An optimistic gatekeeper."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the CAP theorem feel limiting? You can't have it all."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of coffee? Java with a shot of Espresso."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the vector clock so confusing? Time became partial."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a consistent hash ring? A balanced circle."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the gossip protocol spread rumors? That's how it worked."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of tree? A trie - it's so efficient."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the two-phase commit so careful? It asked twice."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a skip list? A probabilistic ladder."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Merkle tree feel secure? Its roots were cryptographic."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite card game? Distributed Poker."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer become a therapist? They were great at handling callbacks."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a developer's favorite pasta? Spaghetti code - unfortunately."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the clean code so admired? Everyone could read it."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a developer at a zoo? Someone watching Python in action."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer love puzzles? Debugging was just harder puzzles."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite game console? The Logic Station."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the short-circuit evaluation feel smart? It saved time."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What do you call an operator with no operands? Lonely."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the yottabyte so legendary? Almost mythical in size."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a computer's favorite exercise? Bit-crunches."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Raft consensus feel stable? It had a strong leader."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a perfect distributed system? Theoretical."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the eventual consistency so zen? It accepted uncertainty."
  },
  {
    "category": "Coding & Git",
    "joke": "A programmer's wife tells him: 'Go to the store and buy a loaf of bread. If they have eggs, buy a dozen.' He comes back with 12 loaves of bread."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers always mix up Halloween and Christmas? Because Oct 31 == Dec 25."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A UDP packet walks into a bar. The bartender doesn't acknowledge him."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Two threads walk into a bar. The bartender yells, 'Hey, I want don't any conditions race like time last!'"
  },
  {
    "category": "Coding & Git",
    "joke": "Debugging: Being the detective in a crime movie where you're also the murderer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are two hard things in computer science: cache invalidation, naming things, and off-by-one errors."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers prefer iOS over Android? Because on iOS, there's only one way to do things. On Android, there are too many. On Linux, there are infinite ways and none of them work."
  },
  {
    "category": "Coding & Git",
    "joke": "git commit -m 'Fixed a bug' // Narrator: They did not fix the bug."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the object-oriented way to get rich? Inheritance."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do Java programmers have to wear glasses? Because they don't C#."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is 10% writing code and 90% understanding why it doesn't work."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "I would tell you a UDP joke, but you might not get it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer had a problem. He thought, 'I'll use regular expressions.' Now he has two problems."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer go broke? Because he used up all his cache and his inheritance was deprecated."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between Java and JavaScript? One is essentially a toy, designed for writing small pieces of code, and historically used for annoying things like scrolling text. The other is a scripting language for web browsers."
  },
  {
    "category": "Coding & Git",
    "joke": "My code doesn't work and I don't know why. My code works and I don't know why."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers get confused between Halloween and Christmas? Because Oct 31 = Dec 25. Oh wait, we already said that. Classic off-by-one error."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who doesn't comment their code? An optimist."
  },
  {
    "category": "Coding & Git",
    "joke": "It's not a bug, it's an undocumented feature."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the JavaScript developer sad? Because he didn't Node how to Express himself, and he had no Backbone, so he couldn't React."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How many programmers does it take to screw in a lightbulb? None, that's a hardware problem. Wait, why is it dark?"
  },
  {
    "category": "Coding & Git",
    "joke": "Real programmers count from 0."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a pirate's favorite programming language? You'd think it's R, but it's actually the C."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer quit his job? He didn't get arrays. His boss didn't get objects. And HR didn't get exceptions."
  },
  {
    "category": "Coding & Git",
    "joke": "Copy-paste is a design pattern."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "In theory, there's no difference between theory and practice. In practice, there is."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate nature? It has too many bugs and no debugger."
  },
  {
    "category": "Coding & Git",
    "joke": "There are only two types of programming languages: those people complain about and those nobody uses."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A QA engineer walks into a bar. Orders a beer. Orders 0 beers. Orders 99999999999 beers. Orders a lizard. Orders -1 beers. Orders a ueicbksjdhd."
  },
  {
    "category": "Coding & Git",
    "joke": "When I wrote this code, only God and I understood it. Now only God knows."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers prefer dark mode? Because light attracts bugs, and they already have enough of those."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A SQL query walks into a bar, walks up to two tables and asks: 'Can I join you?' They reply: 'Sure, but you'll have to wait. We're still trying to relate.'"
  },
  {
    "category": "Coding & Git",
    "joke": "99 little bugs in the code, 99 little bugs. Take one down, patch it around, 117 little bugs in the code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Programmer: A machine that turns coffee into code."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are 10 types of people in this world: Those who understand binary, those who don't, and those who didn't expect a base 3 joke."
  },
  {
    "category": "Coding & Git",
    "joke": "GitHub: Where you can fork someone's repo but not their life decisions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the most used function in a programmer's life? The sleep function... which they never call."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to therapy? It had trouble distinguishing true from false feelings."
  },
  {
    "category": "Coding & Git",
    "joke": "My code is compiling. *Stares at screen for 10 minutes doing nothing*"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dark chocolate? Because it's bitter, like their code reviews."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "The best thing about a Boolean is that even if you're wrong, you're only off by a bit."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Software is like entropy: It's difficult to grasp, weighs nothing, and obeys the second law of thermodynamics - it always increases."
  },
  {
    "category": "Coding & Git",
    "joke": "I don't always test my code, but when I do, I do it in production."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a programmer and a user? The programmer thinks the system works. The user knows better."
  },
  {
    "category": "Coding & Git",
    "joke": "Code never lies. Comments sometimes do."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer stay calm during the outage? They had try-catch blocks around their anxiety."
  },
  {
    "category": "Logic & Boolean",
    "joke": "The generation of random numbers is too important to be left to chance."
  },
  {
    "category": "Coding & Git",
    "joke": "git push --force // Also known as 'Not my problem anymore.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer is told to 'go to hell.' They find the worst thing is that it's a Java shop."
  },
  {
    "category": "Numbers & Bases",
    "joke": "I have a joke about UDP, but I'm not sure if you'll get it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why don't keyboards sleep? Because they have two shifts."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call someone who writes perfect code on the first try? A liar."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Schrödinger's Backup: The condition of any backup is unknown until a restore is attempted."
  },
  {
    "category": "Coding & Git",
    "joke": "There's no place like 127.0.0.1."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer's spouse says: 'While you're out, get some milk.' They never returned."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate meetings? Because they're functions with no return value."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Documentation is like sex: when it's good, it's very, very good; and when it's bad, it's better than nothing."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers always confuse Christmas with Halloween? Because DEC 25 = OCT 31. Still funny every time."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the best way to generate a random string? Put a new programmer in front of vim and tell them to exit."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How do you tell HTML from HTML5? Try it out in Internet Explorer. Did it work? No? It's HTML5."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers prefer hexadecimal? Because decimal is too mainstream and binary is too basic."
  },
  {
    "category": "Coding & Git",
    "joke": "Walking on water and developing software from a specification are easy if both are frozen."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "AI will never replace programmers. Because who else will AI blame when something goes wrong?"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the asynchronous function feel lonely? Because it had no one to await."
  },
  {
    "category": "Coding & Git",
    "joke": "Roses are red, violets are blue, unexpected '}' on line 32."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "The cloud is just someone else's computer, and now their problem."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer use PHP? Because they enjoyed pain."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "In Soviet Russia, code debugs YOU."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the functional programmer get lost? They couldn't find their way without side effects."
  },
  {
    "category": "Coding & Git",
    "joke": "git blame - For when you need to know who to blame for that bug. Spoiler: It's always you."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Premature optimization is the root of all evil. But so is late optimization. So basically, just feel guilty."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the float always approximate? Because precision is expensive."
  },
  {
    "category": "Coding & Git",
    "joke": "The best code is no code at all."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite hangout? The Foo Bar, obviously."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did null and undefined go to couples therapy? They had identity issues."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love their keyboards? It's the only thing that listens to them without talking back."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "In a world without walls and fences, who needs Windows and Gates?"
  },
  {
    "category": "Coding & Git",
    "joke": "The code that works is temporary. The code that doesn't work is permanent."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you get when you cross a developer with a magician? Code that works, but nobody knows why."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the algorithm go to the gym? To improve its runtime."
  },
  {
    "category": "Coding & Git",
    "joke": "Legacy code: Code that makes money."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the startup fail? Too much disruption, not enough code."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Base 8 is just like base 10, really... if you're missing two fingers."
  },
  {
    "category": "Coding & Git",
    "joke": "Programmer: 'I've got a problem.' Friend: 'Have you tried turning it off and on again?' Programmer: 'I AM the problem.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the hardest part about being a programmer? Explaining to family that you don't fix printers."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer prefer cats over dogs? Because cats are more independent and don't require constant attention, just like good code."
  },
  {
    "category": "Coding & Git",
    "joke": "404: Joke not found. Wait, that IS the joke."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the database administrator leave their spouse? Too many foreign key constraints."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's favorite pickup line? 'Are you a compiler? Because you make my heart race with errors.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do backend developers break up with frontend developers? They couldn't agree on REST."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the difference between a developer and a terrorist? You can negotiate with a terrorist."
  },
  {
    "category": "Coding & Git",
    "joke": "Every programmer has two lives. The second one starts when they realize they have only one life and can't respawn."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Agile team cross the road? To deliver value incrementally."
  },
  {
    "category": "Numbers & Bases",
    "joke": "I'd tell you a Fibonacci joke, but it's probably as bad as the last two combined."
  },
  {
    "category": "Coding & Git",
    "joke": "A programmer puts two glasses on the bedside table before going to sleep: one full of water in case they get thirsty, and one empty in case they don't."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior and senior developer? A senior developer knows which Stack Overflow answer to copy."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers think Halloween and Christmas are the same? Because 31 OCT = 25 DEC. Yes, we're telling this joke again because it's that good."
  },
  {
    "category": "Coding & Git",
    "joke": "How to fix a bug: 1) Google the error message 2) Copy code from Stack Overflow 3) It doesn't work 4) Google another error message 5) Repeat"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What did the router say to the doctor? It hurts when IP. The doctor replied: 'Stop pinging yourself.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is like writing a book... except if you miss a single comma on page 203, the whole thing makes no sense."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer's wife asks: 'Could you go to the store and get a gallon of milk, and if they have eggs, get six.' The programmer returns with six gallons of milk. 'Why did you buy six gallons of milk?' 'They had eggs.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers always mix up Christmas and Halloween? Because DEC 25 equals OCT 31. And yes, this is the third time we're telling this joke. That's not a bug, it's recursion."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between 'Undefined' and 'Null'? About $50k in salary between the one who knows and the one who doesn't."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How many programmers does it take to change a light bulb? None. 'It's a hardware issue. Have you tried turning the room off and on again?'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the second hardest thing in computer science after naming things? Explaining to non-programmers that you can't fix their printer."
  },
  {
    "category": "Coding & Git",
    "joke": "Programmer (noun): An organism capable of converting caffeine into code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer go to therapy? Because they had too many unresolved promises."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are 2 hard problems in computer science: cache invalidation, naming things, and off-by-1 errors."
  },
  {
    "category": "Coding & Git",
    "joke": "Real programmers don't comment their code. If it was hard to write, it should be hard to understand."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite exercise? A git pull-up."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the developer get kicked out of school? They kept trying to explain that 'undefined' is not the same as 'not defined.'"
  },
  {
    "category": "Coding & Git",
    "joke": "How do you comfort a JavaScript developer? You console them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Artificial Intelligence will never replace programmers. Someone has to write 'Hello World' in the new framework that comes out every week."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the most dangerous phrase in software development? 'It works on my machine.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer's partner: 'Can you run to the store?' Programmer: 'sudo run to the store' Partner: 'What?' Programmer: 'What?'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call 8 hobbits? A hobbyte. What do you call 1024 hobbits? A hobbikilobyte."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer get stuck in the shower? The shampoo bottle said: Lather, Rinse, Repeat. No exit condition."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "The best comment in code: // I'm not sure why this works, but it does. Don't touch it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "I tried to write a joke in binary, but nobody got it. That's because 01110100 01101000 01100101 01111001 is too long."
  },
  {
    "category": "Coding & Git",
    "joke": "git commit -m 'Fixed stuff' git push --force // Narrator: Nothing was fixed. Everything is worse now."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the asynchronous function go to therapy? It had abandonment issues and couldn't await commitment."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of music? Heavy metal. Because light modes attract bugs."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming: Where the only thing that works on Friday is the 'deploy to production' button."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why don't programmers like to go outside? The graphics aren't good, there's no quest markers, and you can't save your progress."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the difference between Java and JavaScript? About the same as the difference between car and carpet."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate nature? Bugs everywhere, no documentation, and zero Stack Overflow answers."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How to motivate a programmer: 'This will only take 5 minutes.' How to demotivate a programmer: 'This will only take 5 minutes.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the computer cold? It forgot to close its Windows. And yes, that's three 'computer cold' jokes now. We're feature complete."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's least favorite place? Outside. No WiFi, no Stack Overflow, just bugs and sunlight."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A SQL query goes to a restaurant. It walks up to two tables and asks: 'Mind if I JOIN you?' They ignore it. It tries a LEFT JOIN. Still ignored. Finally it tries CROSS JOIN. Now everyone's uncomfortable."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do Python programmers wear glasses? Because they can't C. Why do C programmers wear glasses? Because they can't see sharp. C# programmers just cry."
  },
  {
    "category": "Coding & Git",
    "joke": "The six stages of debugging: 1) That can't happen 2) That doesn't happen on my machine 3) That shouldn't happen 4) Why does that happen? 5) Oh, that's why 6) How did that ever work?"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the best thing about UDP jokes? I don't care if you get them."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dark mode? Light attracts bugs. Also, they're basically vampires at this point."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer's spouse texts: 'Honey, while you're out can you pick up some bread? And if they have eggs, get a dozen.' Programmer returns with 12 loaves. Spouse: 'WHY?!' Programmer: 'They had eggs.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a group of 8 bits? A byte. What do you call a group of 8 programmers? A burnout."
  },
  {
    "category": "Coding & Git",
    "joke": "Code review comments: 'Why?' 'How does this work?' 'This is genius!' 'This is terrible!' All referring to the same line."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the NoSQL database go to therapy? It had trouble with relationships."
  },
  {
    "category": "Numbers & Bases",
    "joke": "I have a great joke about UDP, but I'm afraid you won't get it. Unlike TCP, which will keep telling you the joke until you acknowledge it."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's favorite game? Hide and seek. Because good luck finding that bug."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to eat the seafood? It smelled fishy and had no proper documentation."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What did the Java developer say to the C++ developer? 'You have no class.' C++ developer: 'At least I have friends... err... pointers.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is 10% science, 20% math, and 70% trying to figure out what you did last time that made it work."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the database so emotional? Too many relationships and foreign attachments."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer walks into a bar. Orders a beer. Orders NULL. Orders 99999999 beers. Orders -1 beers. Orders a '; DROP TABLE drinks;--"
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a good programmer and a great programmer? About 2 hours of Stack Overflow browsing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the machine learning model break up with its trainer? It found a better fit elsewhere."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers get Halloween and Christmas mixed up? Because OCT 31 = DEC 25. This is now officially a running gag."
  },
  {
    "category": "Coding & Git",
    "joke": "How many programmers does it take to screw in a lightbulb? None. We just document it as a known issue and move on."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's biggest fear? Not bugs. Not deadlines. It's 'This code was last modified 5 years ago by someone who left the company.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why don't programmers like to be in relationships? Too many dependencies and potential for circular references."
  },
  {
    "category": "Coding & Git",
    "joke": "The three virtues of a programmer: Laziness, Impatience, and Hubris. Mostly laziness."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer start a garden? They heard about branches and thought it sounded relaxing. They were wrong."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite operating system? Windows... said no programmer ever."
  },
  {
    "category": "Coding & Git",
    "joke": "Programmer's life cycle: Coffee → Code → Debug → More Coffee → Question Life Choices → More Code → Success! → Update breaks everything → Repeat"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a developer who gets out of the shower to check if their code is still running? Committed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the Boolean get a divorce? Because their relationship was either True or False, no in between."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the best way to learn programming? Start a project. Get stuck. Google. Copy code from Stack Overflow. Feel guilty. Understand nothing. Ship it anyway. Repeat."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer cry? They just found out semicolons are optional in JavaScript. All those years... wasted."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is easy: 1% writing code, 99% Googling how to write code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call someone who used to code but doesn't anymore? A has-bean. Get it? Java? Beans? No? Tough crowd."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers always carry a ladder? In case they need to reach high-level abstractions."
  },
  {
    "category": "Coding & Git",
    "joke": "The only 'intuitive' interface is the nipple. Everything else is learned. So stop complaining about the UI."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the programmer's version of 'the dog ate my homework'? 'It worked on my local environment.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 6 afraid of 7? Because 7 is a prime number and prime numbers can be intimidating. Also, 7 8 9."
  },
  {
    "category": "Coding & Git",
    "joke": "If debugging is the process of removing bugs, then programming must be the process of putting them in."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a programmer and a software engineer? About $20k and a superiority complex."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get lost in the mall? They were looking for the Exception handler."
  },
  {
    "category": "Coding & Git",
    "joke": "My code is self-documenting. That's what I tell myself before crying in the shower."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who doesn't drink coffee? Asleep."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate the outdoors? Too many dependencies on sunlight.dll."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer's dinner: 1) Order pizza 2) Code while waiting 3) Pizza arrives 4) Keep coding 5) Find cold pizza at 3 AM 6) Victory"
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the most romantic thing a programmer can say? 'You're not undefined to me.'"
  },
  {
    "category": "Coding & Git",
    "joke": "How to name variables: name, name2, nameTemp, nameTemporary, actualName, finalName, finalNameForReal, nameThisTime, okayThisIsTheFinalName"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer die in the shower? The instructions on the shampoo said 'Lather, Rinse, Repeat' and they were stuck in an infinite loop."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are only 10 types of people: those who understand binary, those who don't, those who expected a ternary joke, and those who realize this is actually base 4."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming taught me one thing: I can stare at a screen for 8 hours and accomplish absolutely nothing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a full-stack developer? Someone who's halfway decent at everything and an expert at nothing. Also: exhausted."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dark mode? Because their soul matches their IDE theme."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer's partner asks: 'Do you want to go out for dinner?' Programmer: 'Yes.' Partner: 'Where should we go?' Programmer: 'Yes.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the difference between a developer and a magician? A magician makes bugs disappear. A developer makes features disappear."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you know a programmer is an extrovert? They look at YOUR shoes when talking to you."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer get fired from the fruit stand? They kept trying to compare apples to oranges using ===."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite type of party? A LAN party. No social interaction required."
  },
  {
    "category": "Coding & Git",
    "joke": "Real programmers count from 0. Real users count from 1. Real arguments start from there."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer bring a ladder to work? To reach the cloud."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a virus and Windows? Viruses are well-documented."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is the art of telling another human what one wants the computer to do. And then crying when it doesn't work."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why don't programmers play hide and seek? Because good luck hiding from git blame."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A byte walks into a bar. The bartender asks: 'What'll it be?' Byte: 'Just a bit, thanks.'"
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite breakfast? A cup of Java and a side of C."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer get arrested? They committed to master without a pull request."
  },
  {
    "category": "Numbers & Bases",
    "joke": "How many bits are in a byte? Eight. How many regrets are in a programmer? Infinite."
  },
  {
    "category": "Coding & Git",
    "joke": "The best thing about a Boolean is even if you're wrong, you're only off by a bit. The worst thing is you're completely wrong."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate meetings? It's a function call with no return value and unpredictable side effects."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who's afraid of commitment? Someone who refuses to use Git."
  },
  {
    "category": "Coding & Git",
    "joke": "How to become a senior developer: Step 1: Survive junior developer phase. Step 2: That's it. Survival is the key."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the JavaScript developer wear glasses? Because they couldn't C#. And they refused to learn Java because it wasn't cool."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's faster than the speed of light? A programmer closing tabs when the boss walks by."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers make terrible comedians? Their jokes always have too many nested parentheses (((like this)))."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior dev and a senior dev? Junior: 'It doesn't work and I don't know why.' Senior: 'It works and I don't know why.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the equal sign so humble in math class? Because it knew it wasn't < or >."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite exercise? Running... their code. Definitely not actual running."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer stay up all night? They found a semicolon in their Python code."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer goes to the grocery store with a list: 'Buy milk.' At the store, they never return. They're stuck in an infinite loop at 'Buy milk.'"
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a snake that's 3.14159 meters long? A π-thon."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Docker container feel boxed in? Because it was containerized."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are 10 types of people: those who understand hexadecimal, and F the rest."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you generate a random string? Ask a Windows user to exit vim."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get kicked out of the library? They kept trying to rebase history."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the most dangerous animal for a programmer? A bugbear."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do Java developers wear glasses? Because they can't C# clearly enough to realize Java is verbose."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who only codes in one language? A specialist. What do you call a programmer who codes in many languages? Unemployed, because they're too busy learning."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why don't programmers like to exercise? The only running they do is running code."
  },
  {
    "category": "Coding & Git",
    "joke": "How many Microsoft engineers does it take to screw in a lightbulb? None. They just declare darkness as the new standard."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's worst nightmare? 'Works on my machine' becoming 'Worked on my machine.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers prefer dark chocolate? Because it's less likely to contain bugs than white chocolate."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a bug and a feature? Documentation."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer fail the driving test? They kept trying to shift bits instead of gears."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a room full of programmers? A stackoverflow."
  },
  {
    "category": "Coding & Git",
    "joke": "How to center a div: Step 1: Google 'how to center a div' Step 2-99: Try different solutions Step 100: Give up and use Flexbox"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CSS file feeling down? It had no class and lost all its style."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite fairy tale? Hansel and Gretel, because of the breadcrumb navigation."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate mornings? Because they're still debugging last night's code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a programmer and a software engineer? About three years and a degree they never use."
  },
  {
    "category": "Numbers & Bases",
    "joke": "I tried to write a joke in base 13, but it was D."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer quit their job? They didn't get arrays. Actually, they got arrays, but they were out of bounds."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A SQL statement walks into a NoSQL bar. Leaves immediately because it couldn't find a table."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of tree? A binary tree, because it's the only thing in their life that's balanced."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you know you're dating a programmer? They refer to your relationship as 'our codebase.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the AI go to school? To improve its learning rate. It dropped out because it overfit."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of meditation? Transcendental Recursion."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love keyboards? Because they're the only thing that listens without judgement. Until you press the wrong key."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between Windows and a virus? You can remove a virus."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number 8 break up with 7? Because 7 ate 9, and 8 didn't want to be next."
  },
  {
    "category": "Coding & Git",
    "joke": "Programming is easy: You just need to know 1000 things and remember to never do 999 of them."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why don't programmers like revolving doors? Too many loops, no clear exit condition."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a developer who doesn't know Git? Lost in version hell."
  },
  {
    "category": "Coding & Git",
    "joke": "How many programmers does it take to kill a process? kill -9. Always kill -9."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the REST API so tired? Too many GET requests and not enough sleep endpoints."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's love language? Comments. Clear, concise comments."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers always mix up Christmas and Halloween? Because DEC 25 = OCT 31. This joke is now deprecated but still in production."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the first rule of optimization? Don't. What's the second rule? Don't... yet."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 0 jealous of 8? Because 8 has a belt and 0 has nothing."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite place to vacation? The cloud. It's always available and infinitely scalable."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse therapy? It was in denial. Which is neither true nor false."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a programmer and a hacker? A programmer builds locks. A hacker picks them. Both blame Microsoft."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you comfort a JavaScript developer having an existential crisis? Tell them they're not undefined, just asynchronous."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the microservice go to therapy? It felt too small and insignificant in the larger system."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite time of day? 3 AM, when the bugs finally make sense."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate the beach? Sand. It's coarse, rough, and it gets everywhere. Also, no WiFi."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a developer who writes perfect code? A mythical creature, like a unicorn or a reasonable deadline."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the bit go to the doctor? It was feeling a little off. The doctor said: 'You're just not aligned.'"
  },
  {
    "category": "Coding & Git",
    "joke": "How to explain programming to a non-programmer: 'I write recipes for a very stupid chef who follows them exactly.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get stuck at the crosswalk? They were waiting for someone to call the walk() function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite martial art? Kung Fu. Specifically, Kung Foo Bar."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer pets over children? Pets have fewer dependencies and are easier to debug."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the hardest part about being a programmer? Explaining to your family that you can't fix their iPhone."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the functional programmer refuse to date? They were afraid of mutable relationships."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite pickup line at a bar? 'Are you a keyboard? Because you're my type.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the blockchain developer break up? They couldn't trust anyone after so many 51% attacks."
  },
  {
    "category": "Numbers & Bases",
    "joke": "How do you make 7 even? Remove the 's'. How do you make it odd? Add 'ly' to make it oddly."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate laundry? Because they have too many loads to balance and the sorting algorithm is terrible."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's idea of multitasking? Reading Stack Overflow while code compiles while coffee brews."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the machine learning model so expensive to train? It had expensive taste in GPUs."
  },
  {
    "category": "Coding & Git",
    "joke": "What do you call a programmer who doesn't use Stack Overflow? A liar."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer always carry a screwdriver? In case they needed to debug hardware."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the difference between a programmer and a user? A programmer sees a bug and fixes it. A user sees a bug and breaks everything trying to reproduce it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers shower at night? Because they fix bugs in their sleep and wake up dirty."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a DevOps engineer? A sysadmin who can't say no to developers."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 6 afraid of 7? Because 7 is a registered six offender."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a good commit message and a bad one? A good one tells you what changed. A bad one says 'stuff.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer wear headphones? To avoid while(1) conversations."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who only tests in production? Brave. Or unemployed. Usually unemployed."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you know if someone uses Arch Linux? Don't worry, they'll tell you. Repeatedly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the cybersecurity expert break up with their partner? Too many trust issues and not enough encryption."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite sport? Sprint planning."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee? Because Java was already taken as a language name."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the programmer's version of a midlife crisis? Switching from tabs to spaces. Or vice versa."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer bring a sleeping bag to work? For the all-nighter debugging session that 'will only take 5 minutes.'"
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite movie? The Matrix. Because it's the only movie where the hero is a programmer who actually saves the world."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the blockchain developer become a philosopher? They were obsessed with decentralized truth."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's the difference between 1 and 1.0? About 4 bytes and a lot of confusion."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you know someone just learned React? They'll rewrite their entire app using it. Twice."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get lost in the forest? They couldn't find the root directory."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite Shakespeare quote? 'To code or not to code.' Actually, there is no 'not to code.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate small talk? Because 'How are you?' doesn't return a proper status code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who actually reads the documentation? A unicorn. Or new."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the programmer always single? They kept waiting for the perfect match, but only got null."
  },
  {
    "category": "Coding & Git",
    "joke": "How many programmers does it take to change a light bulb? Just one, but the light bulb has to want to change."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior and senior developer? A junior breaks production. A senior knows how to hide it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer start counting at zero? Because they wanted to get ahead in life."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite weather? Cloudy, but not too cloudy. Just enough for cloud computing."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers prefer dogs over cats? Because dogs have better exception handling - they always come when called."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the most optimistic thing a programmer can say? 'This should work.' Narrator: It did not work."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer get kicked out of the orchestra? They couldn't C sharp and refused to B flat."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite constellation? The Array. Wait, that's not a real constellation. Neither is their work-life balance."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer fail art class? They could only draw in pixels and vectors."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the best way to learn a new programming language? Start a project with a deadline. Panic is a great motivator."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the DevOps engineer bring an umbrella? In case of a storm in the cloud."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a group of programmers? A merge conflict waiting to happen."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate Valentine's Day? Because undefined loves you is not very romantic."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's New Year's resolution? Write better code. Actual result: Write more code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the algorithm so confident? It had O(1) self-esteem."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you annoy a programmer? Tell them their code is 'almost working.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of investment? Tech stocks, because they understand the crashes."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer wear sunglasses? Their future was too bright. Also, dark mode at maximum brightness."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between 'undefined' and 'null'? One is JavaScript's way of saying 'I don't know.' The other is JavaScript's way of saying 'I know it's nothing.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the machine learning engineer become a therapist? They were good at pattern recognition and bad at human interaction."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite number? 42. But they don't know why."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers always look tired? Because they spend all night chasing bugs that only appear in production."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's idea of a balanced diet? A laptop on each knee."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the API feel rejected? Too many 401 responses and not enough authentication."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you know you're working with legacy code? The original author is either retired or in witness protection."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite gym exercise? Pushing to production. Cardio happens when it breaks."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse to date? It was committed to being single (true)."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the most terrifying phrase in software development? 'Hey, do you have a minute?'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer become a gardener? They heard about branches, forks, and cherry-picking. Reality was disappointing."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's least favorite number? NaN. It's literally not even a number."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate phone calls? Because they can't Google the conversation in real-time."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of humor? Dry, sarcastic, with a hint of existential dread."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the cache always so popular? Everyone wanted to get with them quickly."
  },
  {
    "category": "Coding & Git",
    "joke": "How to become a 10x developer: Write code so bad that it takes 10 developers to fix it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech lead and a developer? A tech lead knows which meetings to skip."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get kicked out of the casino? They kept trying to count cards in binary."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of music? Algorithm and blues. Heavy metal for debugging."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the startup fail? They focused on the MVP instead of the actual product. And they ran out of runway."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's infinity + 1 in JavaScript? Still infinity. Also, JavaScript doesn't care about your math."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer working from home? Because 'home' is where the WiFi connects automatically."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite card game? Poker, because they're good at reading stack traces."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the garbage collector so underappreciated? Because everyone takes memory management for granted."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the first rule of coding? Don't talk about the spaghetti code you wrote last year."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the distributed system feel lonely? All its friends were in different data centers."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite dance? The Debug Shuffle: Two steps forward, three steps back."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical keyboards? The clicking sound makes them feel productive."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between AI and ML? About $50k in salary and a lot of buzzwords."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 10 afraid of 7? Because 7 8 9. In binary, that's actually 111 1000 1001. Still scary."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of vacation? A staycation with no Slack notifications."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer join a band? They wanted to improve their composition skills. They failed."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a cloud architect's worst nightmare? The cloud provider going down. Or the bill."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because unexpected behavior should only happen in code, not in life."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call a programmer who works out? A buffer. They're trying to avoid overflow."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the recursion joke fail? See: Why did the recursion joke fail?"
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's motto? 'If it ain't broke, add more features until it is.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Kubernetes engineer feel overwhelmed? Too many pods to manage and not enough coffee."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite mathematical constant? Pi. Because pie is delicious during late-night coding."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers make bad dancers? They have two left feet and both are statically typed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's idea of time travel? Git checkout to a previous commit."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the load balancer stressed? It couldn't handle the pressure of distributing requests evenly."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a programmer and a psychic? A psychic can predict the future. A programmer can't even predict their code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the penetration tester break up with their partner? They found too many vulnerabilities."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite season? Fall, because of all the stack dumps."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love acronyms? Because TLDR: Typing Less Delivers Results."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a bug and an Easter egg? Documentation and intent."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer hate Roman numerals? No zero, and they couldn't count backwards."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite board game? Monopoly, because they understand the concept of buying properties you can't afford."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the while loop break up with the for loop? It needed more space and fewer constraints."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a Site Reliability Engineer? A firefighter who started the fire."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer tea over coffee? They don't. That's a lie. Coffee or death."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between frontend and backend developers? Frontend makes it look good. Backend makes it actually work. Both blame each other."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer go to the psychiatrist? They had too many mental breakpoints."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite magic trick? Making bugs disappear by closing the ticket."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the continuous integration pipeline so successful? Because it failed fast and often."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's the programmer's favorite prime number? 31. Because OCT 31 = DEC 25. We're never letting this joke go."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate sand? It's coarse, rough, irritating, and gets in the keyboard."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of relationship? One with good interfaces and clear boundaries."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Bitcoin miner go broke? High electricity bills and low cryptocurrency prices."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fitness? Stand up every two hours. Stretch. Regret life choices. Sit back down."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the neural network so deep? It had a lot of layers. And issues."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite childhood game? Hide and seek. They're still looking for that bug from 2015."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate Mondays? Because they deployed on Friday and the bugs are back."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a data scientist and a statistician? About $30k and a Python certification."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer get confused at the restaurant? The menu was base 10, but they were thinking base 2."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's last words? 'It compiles, ship it!'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the exception get invited to every party? Because everyone wanted to handle it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite dinosaur? The Veloci-debugger."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love pizza? Because it's the only thing that delivers faster than their CI/CD pipeline."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between Agile and Waterfall? Agile is chaos with standups. Waterfall is chaos with Gantt charts."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer always win at poker? They knew when to fold, call, and raise exceptions."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite historical period? The Renaissance. Because of the rebasing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite exercise? Jumping to conclusions."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer get divorced? Their relationship had too many dependencies and no rollback plan."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's the programmer's prayer? 'Dear God, please let this work. I promise I'll add comments this time.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the regex developer go insane? They tried to parse HTML. Never parse HTML with regex."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite element? Silicon. It's in all their chips."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate meetings? Because async/await doesn't work in real life."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite pickup line? 'Are you a compiler? Because you make my heart race with syntax errors.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the packet sniffer so nosy? It literally captured everyone's conversations."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a programmer and a fortune teller? Fortune tellers admit they're guessing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the encryption algorithm feel secure? Because nobody understood it, including the developer."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite breakfast cereal? Loops. Fruit Loops. Infinite Loops."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical pencils? Because they appreciate good pointers."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a hacker and a programmer? A hacker breaks into your house. A programmer builds the house so poorly you can walk in."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 0 the loneliest number? Because it's literally nothing."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's idea of spring cleaning? Deleting commented-out code from 2018."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the developer wear two pairs of glasses? Because they wanted to C## better."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a quantum programmer's favorite state? Superposition. They're simultaneously working and not working."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers make terrible spies? They leave traces everywhere and can't clear their history."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior dev's code and a senior dev's code? About 500 lines and the same result."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer go to the beach? To test their code in a sandbox environment."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of shoes? Sneakers. For sneaking past the QA team."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CDN so reliable? It had trust issues and kept multiple copies of everything."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What do you call a programmer who can count to 1024 on their fingers? Normal. They use binary."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate social events? Too many threads and race conditions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite movie genre? Suspense. Waiting for code to compile is thrilling."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the load balancer go to therapy? It couldn't handle the weight of everyone's requests."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to parenting? If child.crying() then feed() else sleep(). It never works."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the DNS so forgetful? It kept flushing its cache."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite magic spell? Control + Z. The undo spell."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love dark chocolate? It's bitter, like code reviews."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a bug and a feature? The bug is documented."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer prefer base 64? Because it looked cooler in URLs."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of bread? Batch files. Get it? Never mind."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a minimalist? Too many dependencies ruined their life."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a reverse proxy's job? To stand between you and the truth."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate New Year's Eve? They're busy fixing Y2K bugs that never ended."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a data lake and a data swamp? About 6 months and no documentation."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to law school? To argue true or false in court."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite pet? A python. Or a gopher. Or a rust crab."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the message broker so popular? Everyone wanted to subscribe to its topics."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite temperature? 0 Kelvin. Absolute zero bugs."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies? To hide from management and the sun."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite yoga pose? The fetal position after a production deploy."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the API rate limiter feel mean? It kept telling people 'Too Many Requests.'"
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a programmer and a terrorist? You can negotiate with a terrorist. We already said this. Stack overflow in jokes."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the service worker so helpful? It worked in the background without being asked."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite instrument? The keyboard. The only instrument they can play."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate haircuts? Because they're used to cutting corners, not hair."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a chaos engineer's motto? 'Break things in production before they break themselves.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer love the number 256? Because it's 2^8 and perfectly byte-sized."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite childhood toy? Lego. Because building and debugging is basically the same."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer fail the driving test? They kept trying to override the instructor."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between monitoring and observability? About $100k in vendor costs."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love winter? Fewer bugs. Cold kills bugs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a container's biggest fear? Being orphaned with no parent process."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a chef? They wanted to work with better cookies."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite TV show? The IT Crowd. Have you tried turning it off and on again?"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the event loop so busy? It never stopped checking if something needed to be done."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's least favorite number? 404. Not found. Story of their life."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate restaurants? The menu has no search function."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of tree? An abstract syntax tree. The only tree that makes sense."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the WebSocket feel connected? Because it maintained a persistent relationship."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fashion? Black hoodie, jeans, same shoes for 5 years."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the static site generator so fast? No backend, no problems."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite holiday? Sysadmin Appreciation Day. Just kidding, they don't take holidays."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love cats? Because cats are independent, do their own thing, and ignore you. Just like good code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between horizontal and vertical scaling? Horizontal: Buy more servers. Vertical: Buy bigger servers. Both: Expensive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 7 the luckiest number for programmers? Because 7 8 9 and got away with it."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite condiment? Sauce. Open source, of course."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer join a gym? To work on their core. Core dumps, specifically."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a serverless function's favorite song? 'Don't Stop Believing' by Journey. Because it keeps getting invoked."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because 'unexpected token' is traumatic enough."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech startup and a dumpster fire? The dumpster fire is self-sustaining."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer always carry a notebook? To write down bugs they couldn't reproduce."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite word? 'Works.' As in 'It finally works!'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the cron job so punctual? Because it had a schedule and stuck to it, unlike developers."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite state of matter? Solid State Drives."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love sci-fi? Because it's the only genre where their social skills are normal."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite time? Compile time. Also the worst time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the cache miss feel disappointed? It expected something but found nothing."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to happiness? Lower your expectations. Way lower."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the database index so organized? It knew where everything was. Unlike the developer."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite Shakespeare play? Much Ado About NULL Thing."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers make terrible comedians? Their timing is always off by one."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of pizza? Deep dish. Like their call stacks."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer love the number 1337? Because they're leet. Or were, in 2005."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a programmer and a philosopher? Programmers know their code doesn't work. Philosophers pretend they know."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a musician? They wanted to work with better arrays and better loops."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a DevSecOps engineer? Someone who says 'security' three times and hopes it sticks."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate mornings? Because they're still living in yesterday's timezone."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior and senior architect? Juniors draw boxes. Seniors draw boxes with arrows."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get kicked out of the library? They kept trying to import books instead of borrowing them."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite superhero? Batman. He's rich, has cool gadgets, and works at night."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the API gateway so tired? It stood between clients and services all day long."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite number system? Whatever system has the fewest bugs."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee shops? Free WiFi and socially acceptable isolation."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite board game? Debug. Wait, that's not a game. It should be."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the edge function feel anxious? It was always on the edge."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's motto? 'Move fast and break things.' Then spend 6 months fixing them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer become a bartender? They were good at handling exceptions and serving requests."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of car? A Tesla. It gets updates over the air and sometimes breaks randomly."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate small talk? There's no API documentation for human interaction."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a senior engineer and a staff engineer? Staff engineers attend more meetings and write less code."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 42 the answer to everything? Because programmers said so and nobody questioned it."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of joke? Self-referential ones. Like this one."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get fired from the zoo? They kept trying to fork the animals."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a microservice's worst fear? Being called for something it wasn't designed to do."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love rubber ducks? Because they listen without interrupting. Rubber duck debugging is real."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between DevOps and SRE? About $20k and the word 'reliability.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to play cards? Too many random shuffles and not enough deterministic outcomes."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite dessert? Cookies. Session cookies, authentication cookies, all the cookies."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the message queue so patient? It knew good things come to those who wait in line."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite shape? A square. Because everything is a box model."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers make terrible poets? They can't think outside the box. Everything is inside a container."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of humor? Recursive. And if you don't get it, see: What's a programmer's favorite type of humor?"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Kubernetes pod feel lonely? All its replicas were in different namespaces."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the difference between a junior and senior developer's Git history? Seniors use rebase. Juniors use 'git commit -m fix'."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the load balancer always fair? It treated every request equally. Until one service went down."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite planet? Mars. Because Elon codes. Allegedly."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate grocery shopping? No version control for their cart."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a distributed system's favorite phrase? 'It's not my fault, it's eventual consistency.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer prefer base 16? Because F is the highest grade they could get."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite pickup line? 'Is your name Wi-Fi? Because I'm feeling a connection.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a gardener? They wanted to work with better branches and merges."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a bug and a race condition? A race condition is a bug that only happens sometimes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies? Built-in debugging mode - hood up means do not disturb."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a programmer's favorite type of cloud? The one that doesn't rain on their parade. Or go down."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean get a tattoo? To show it was truly committed."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's guide to time management? Spend 8 hours fixing a 5-minute problem."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the encryption key so secretive? Because that's literally its job."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite letter? C. Or C++. Or C#. Definitely not JavaScript."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate phone interviews? Can't Google the answers in real-time."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite mythical creature? A unicorn startup that's actually profitable."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the circuit breaker feel protective? It prevented cascading failures by failing first."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to work-life balance? Work is life. Life is work."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the API so well-documented? Just kidding, it wasn't."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of story? One with proper closure and no dangling plots."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical keyboards? The loud clicks announce their productivity."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a monolith and microservices? One big problem vs. many small problems."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 1 the loneliest number? Because it's the only positive integer that's neither prime nor composite."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite social media? GitHub. The only platform where their contributions matter."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to go camping? No electricity, no internet, no IDE. Basically hell."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a container registry's job? To store images that will eventually be forgotten and take up space."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dogs over cats? Dogs have better error handling - they always come when called."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech lead and an architect? Tech leads write code. Architects draw pictures."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the exception handler go to therapy? It was tired of catching everyone's problems."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of music at work? Silence. Or lo-fi beats. Never colleagues talking."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the reverse proxy so confused? It didn't know if it was coming or going."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite Olympic event? The 100-meter dash. To the coffee machine."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate elevators? Waiting is like watching code compile, but in real life."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite magic trick? Making production bugs disappear by blaming the environment."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the webhook feel reactive? Because it only responded when triggered."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fashion? If it works, don't change it. Same shirt for a week."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the service mesh so complicated? Because simple solutions don't justify the complexity."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of vacation? A staycation with unlimited bandwidth."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love winter? Fewer outdoor activities means more coding time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between staging and production? Staging is where bugs hide. Production is where they thrive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer love the number 80? Because it's the HTTP port for success."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of comedy? Dark comedy. Like their IDE theme."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer join a book club? To learn about proper documentation. They didn't stay long."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a traffic manager's job? To route requests and blame the backend when things fail."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because 'unexpected behavior' is already their daily reality."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between horizontal scaling and wishful thinking? About the same budget."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a philosopher? To understand the meaning of null."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of puzzle? Debugging production at 3 AM. Wait, that's not fun."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the SSL certificate so expensive? Because security is priceless. And also $50/year."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite time of day? 13:37. Leet o'clock."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love acronyms? Because TL;DR: They save time."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of art? ASCII art. The only art they understand."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the cache invalidation fail? Because it's one of the two hard problems in computer science."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to cooking? Order takeout and call it 'API integration.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CDN so fast? It cached everything and forgot nothing. Like a programmer's mistakes."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of exercise? Mental gymnastics to justify technical debt."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because production should be boring, not exciting."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a framework and a library? You call a library. A framework calls you."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 404 the saddest number? Because it means something is lost and will never be found."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of movie? One they can pause to check their phone for alerts."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to play chess? Too many edge cases and not enough unit tests."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a service worker's favorite hobby? Working in the background without recognition."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee? Because sleep is just a delay function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior and senior engineer? Juniors ask 'How?' Seniors ask 'Why?' Both end up doing it anyway."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse to compromise? Because it's either true or false, no in-between."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of shoes? Comfortable ones. They'll be wearing them for 16 hours."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the rate limiter so strict? Because 429 Too Many Requests is the nicest way to say 'slow down.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite prime number? 31. Because OCT 31 = DEC 25. Yes, again."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate traffic? Because it's like a poorly optimized algorithm with O(n²) complexity."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of beer? Root beer. Or anything with high caffeine content."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the distributed system feel stressed? Because consistency is hard when everyone's far apart."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to relationships? If (partner.happy()) { continue; } else { debug(); }"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the lambda function so minimal? Because it only did one thing and did it anonymously."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite historical figure? Alan Turing. The OG programmer who broke codes and barriers."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate small fonts? Because they can't C clearly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech conference and a networking event? At conferences, you pretend to understand the talks. At networking events, you pretend to like people."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 128 a nice number? Because it's 2^7 and fits in a signed byte. Sort of."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of weather? Overcast. Perfect screen visibility."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a detective? They were already good at finding bugs and tracing execution paths."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a secrets manager's worst nightmare? Being stored in plain text in a Git repository."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate meetings? Because 'This meeting could have been an email' could have been a Slack message."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite breakfast? Syntax errors. Just kidding, it's panic and coffee."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the container orchestrator feel powerful? Because it controlled an entire fleet with one command."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite number? Infinity. Because their todo list never ends."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer texting? Because verbal communication doesn't support syntax highlighting."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic? Whatever works. They don't care about philosophy."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the database transaction so careful? One wrong move and everything rolls back."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to exercise? Walking to the coffee machine counts as cardio."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the message bus feel overwhelmed? Too many messages and not enough bandwidth."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite game? Russian Roulette. Also known as 'deploying on Friday.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love keyboards with RGB lights? Because if it glows, it goes faster. Obviously."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between cloud computing and traditional hosting? About 10x the cost and 10x the buzzwords."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 255 a magic number? Because it's the maximum value for an unsigned byte. Perfectly balanced."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of documentation? The kind that exists. Any kind. Please."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to swim? Too many streams and they couldn't handle the flow."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a monitoring system's favorite phrase? 'Everything is on fire, but the metrics look good.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate autocorrect? Because it doesn't understand their variable names."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a bug and a feature request? About 2 weeks and a product manager's approval."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a teacher? They wanted to educate the next generation of Stack Overflow copiers."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite punctuation? Semicolons. Unless you're writing Python, then it's betrayal."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the event-driven architecture so reactive? Because it only did things when something happened."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's least favorite number? Any number that causes an overflow."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love standing desks? So they can run away from bugs faster."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of party? A LAN party. Minimal social interaction required."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the API versioning get complicated? Because v1 was too simple and v2 broke everything."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to dating? If (compatible) { commit(); } else { git reset --hard; }"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the CI/CD pipeline so confident? Because it failed fast and recovered quickly."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite superhero power? Time travel. To undo that production deploy."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate printers? Because they're the opposite of plug-and-play."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a load balancer's favorite saying? 'Share the load.' - Samwise Gamgee, probably."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 69 a funny number? Because programmers are 12 years old at heart. Also, it's 0x45 in hex."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of feedback? Constructive. Or none at all. Preferably none."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer fail at meditation? They couldn't stop thinking about edge cases."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a full-stack developer and a unicorn? Unicorns are more realistic."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies? Because it's socially acceptable pajamas."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a container's favorite movie? The Matrix. Because it's all about virtual environments."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer bring a pillow to work? For the inevitable crash."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's favorite game show? Who Wants to be a Millionaire? They don't, they want good documentation."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the DNS lookup so slow? Because it was still trying to resolve family issues."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite binary number? 10. It could be 2, or it could be anything."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate small talk? Because 'How are you?' returns undefined."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite bedtime story? The one where the code works on the first try. Pure fiction."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the service mesh feel complicated? Because networking wasn't hard enough already."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of chair? One that doesn't squeak during video calls."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the edge computing so trendy? Because everyone wants to be on the edge, apparently."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of lock? Mutex. It's exclusive and they understand it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical pencils? Good pointer management."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a principal engineer and a staff engineer? About $50k and more meetings."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 0xDEADBEEF a famous number? Because even hex numbers can die in style."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of music? Lo-fi beats to code/relax to. Or metal. No in-between."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a minimalist? Too many objects in their life and code."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a CDN's favorite hobby? Caching in on everyone's content."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate phone calls? Because they can't Ctrl+F the conversation."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech lead and a team lead? Tech leads code. Team leads attend meetings about coding."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to couples therapy? It couldn't handle the constant true/false accusations."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of sandwich? One they can eat with one hand while typing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the message broker so popular? Everyone wanted to subscribe to its channels."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite irrational number? Pi. Because pie is delicious and irrational cravings happen."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love dark themes? Because their soul is dark. Also, less eye strain."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of joke? One that's well-formed and returns a punchline."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the cache feel guilty? It was storing things it shouldn't remember."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to socializing? Avoid eye contact, mention Stack Overflow, leave."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the webhook so reliable? Because it always delivered when called."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of magic? The kind that makes bugs disappear. It doesn't exist."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because 'unexpected token' is already triggering enough."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a microservice and a nanoservice? About 50 lines of code and a lot of hubris."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 1337 still relevant? Because programmers are leet. In their minds, at least."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of pet? A server. It needs constant attention and feeding."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to play sports? Too much physical activity, not enough keyboard time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a distributed cache's worst fear? Network partitions. Split personality disorder for systems."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love stickers on laptops? To hide the shame of their debugging sessions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between observability and monitoring? About $100k in tools and a lot of dashboards."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a writer? They wanted to debug their life story."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of weather forecast? Cloudy with a chance of downtime."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the API rate limiter so mean? Because it had to say no 429 times a second."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite negative number? -1. Because it's the universal error code."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate video calls? Too much bandwidth, not enough mute button."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of therapy? Pair programming. Shared trauma builds character."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the service discovery feel lost? Because it couldn't find itself in the registry."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's motto for life? 'It compiles, therefore I am.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the load shedding so brutal? Because when the system's drowning, someone has to go overboard."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of vacation? One without laptop. Just kidding, that doesn't exist."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee shops? Because working from home means being alone with their thoughts."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a circuit breaker's philosophy? Fail fast, recover faster, blame infrastructure."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 420 funny to programmers? Because they're still 12. Also, it's 0x1A4 in hex."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of book? One with code samples that actually work."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to dance? Too many steps and no clear algorithm."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a serverless function's biggest complaint? 'I'm not really serverless, I'm just someone else's problem.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love multiple monitors? Because one screen for code, one for Stack Overflow, one for crying."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a data engineer and a data scientist? Engineers build pipelines. Scientists blame the pipelines."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate small fonts? Because they couldn't C# at that size."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite sport? Extreme debugging. It's a contact sport with keyboards."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the event sourcing so nostalgic? Because it remembered every single thing that happened."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite even number? 2. It's the oddest prime number."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate elevator music? Because it loops forever with no exit condition."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite philosophy? Pragmatism. Does it work? Ship it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the distributed transaction fail? Because 2PC is hard and 3PC is harder."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to happiness? Lower expectations, increase coffee intake."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the blockchain developer feel immutable? Because once they made a decision, they couldn't change it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of cookie? Session cookies. They're temporary, like their motivation."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate birthdays? Because age++ is a constant reminder of time passing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a Kubernetes cluster's favorite song? 'We Are Family' by Sister Sledge. All my pods and me."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 13 unlucky for programmers? Because arrays start at 0 and 13 means you're off by one."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of joke timing? Asynchronous. The punchline comes later."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a monk? To achieve inner null and outer peace."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a data warehouse and a data lake? One is organized chaos, the other is just chaos."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love pizza? Because it's O(1) to eat and O(n) to share."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a rate limiter's favorite phrase? 'Slow down, you're going too fast.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate mirrors? Too much reflection and self-referencing."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of exercise? Running migrations. It's the only running they do."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the eventual consistency so zen? Because it knew everything would be okay... eventually."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite hexadecimal digit? F. Because that's what they got in math class."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate shopping? No undo button for impulse purchases."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of door? One with proper access control and authentication."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the garbage collector feel unappreciated? Because everyone only notices when it's NOT working."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to romance? If (love) { while(true) { commit(); } }"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the API gateway so tired? Because it stood at the entrance checking everyone's credentials."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of restaurant? One with a good API... wait, that's not how restaurants work."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love cats? Because cats are independent, ignore you, and do their own thing. Perfect pets."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a distributed trace's job? To follow the breadcrumbs through the microservice forest."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 0.1 + 0.2 not equal to 0.3? Because JavaScript said so. Don't question it."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of comedy? Observability. Wait, no, that's not funny."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to go to the gym? Too many reps and not enough REST."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a service mesh's favorite hobby? Connecting services that could have just talked directly."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical keyboards? The clicking sound masks the sound of their stress."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a container and a VM? About 500MB and a lot of technical arguments."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to anger management? Because it was always flipping out."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite pickup line? 'Are you a commit? Because I want to push you to production.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the health check endpoint so anxious? Because everyone kept asking if it was okay."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite Roman numeral? None. They don't have zero. Useless."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate fashion? Too many layers and no clear stack trace."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of car? One with cruise control. Like their automated tests."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the dead letter queue feel depressed? Because it was where failed messages went to die."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to productivity? Procrastinate with side projects instead of main project."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the cache hit ratio so proud? Because it succeeded more than it failed. Unlike the developer."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of music video? One with good buffering."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies with zippers? Easy on, easy off, just like their production deploys."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a circuit breaker's favorite movie? The Fault in Our Services."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 65535 a special number? Because it's the maximum for unsigned 16-bit. Also, Christmas lights."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of tree? A decision tree. The only tree with clear logic."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate riddles? Not enough type safety and too much ambiguity."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a senior engineer and a principal engineer? Principals have 'opinions' instead of 'suggestions.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love noise-canceling headphones? To cancel out reality."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a blue-green deployment's worst fear? Forgetting which one is production."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a vegan? Too many memory leaks from eating meat. Wait, that doesn't make sense."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of map? A hash map. It's fast and efficient."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the feature flag so indecisive? Because it could be on OR off. Classic boolean behavior."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite fraction? 1/0. Because it's infinitely interesting. And crashes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate clocks? Because time is a social construct and deadlines are violence."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of fish? A beta fish. Alpha is too risky."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the canary deployment feel nervous? Because it was sent in first to test the waters."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fashion? Comfortable over stylish. Function over form."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the ingress controller so bossy? Because it controlled who got in."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of joke structure? Setup, execution, return punchline."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love socks? Because they come in pairs, like programming."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a sidecar pattern's favorite saying? 'I'm not the main character, but I'm essential.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 1024 better than 1000? Because 2^10 is more satisfying than 10^3."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite season? Fall. Because of falling back to standard time and falling tests."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to play poker? Too much bluffing, not enough boolean logic."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a request timeout's favorite phrase? 'Sorry, I gave up waiting for you.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love winter? Fewer bugs. Cold weather kills them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between stateful and stateless? About 100GB of session data."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate philosophy? Too many undefined terms and no compilation errors."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of magic? The kind that makes code work. Still looking for it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the retry logic so persistent? Because at first you don't succeed, retry, retry again."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite multiplication? 8 * 8 = 64. Perfectly byte-ful."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee? Because sleep is for the weak and the unemployed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of bird? A Java sparrow. Or a Python snake. Wait, that's not a bird."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the rate limiting algorithm feel guilty? Because it kept rejecting requests."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to health? Don't die. Ship code. Repeat."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the connection pool so exclusive? Limited slots, high demand."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of exercise? Exception handling. It's a mental workout."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate traffic lights? Too much waiting and not enough threading."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a saga orchestrator's job? To coordinate chaos across distributed systems."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 512 a nice number? Because it's 2^9 and half a kilobyte. Perfect."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of cheese? String cheese. Obviously."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a pilot? To navigate through cloud infrastructure."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a backpressure mechanism's motto? 'Slow down or I'll drop you.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love standing desks? So they can quickly run when production breaks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a hotfix and a patch? Hotfix is urgent. Patch is 'we'll get to it eventually.'"
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse to attend therapy? It was either going or not going. No middle ground."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of tea? Java. Wait, that's coffee."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the idempotency key so reliable? Because doing it twice was the same as doing it once."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite power of 2? All of them. They're all beautiful."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate surprises? Because production surprises are never good."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of flower? A binary tree. Wait, that's not a flower."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the graceful shutdown feel polite? Because it cleaned up before leaving."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to vacation? Bring laptop. Check Slack. Not really a vacation."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the circuit breaking so dramatic? Because it literally cut connections."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of salad? Word salad. From bad documentation."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love blankets? Because they're wrapped in comfort, like error handling."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a chaos monkey's favorite pastime? Breaking things randomly to prove a point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 2048 satisfying? Because it's 2^11 and also a great game. Perfect procrastination."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dark mode? Because their code is already dark enough."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a load shedder's philosophy? When drowning in requests, throw some overboard."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate riddles? Because ambiguity causes compilation errors in life."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite holiday? System Maintenance Day. Everything's expected to be down."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the eventual consistency model so patient? It knew things would work out... eventually. Maybe."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite number sequence? Fibonacci. It's recursive and beautiful."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate autocorrect? Because it changes 'null' to 'bill' and breaks everything."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic gate? NAND. Because it can build anything. Literally."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the distributed lock feel powerful? Because it controlled access across the entire system."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fashion? Black everything. Minimizes decision fatigue."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the time-to-live (TTL) so mortal? Because everything expires eventually."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of comedy? Deadpan. Like their code reviews."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love compression? Because they can fit more procrastination into less time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a content delivery network's motto? 'Be everywhere at once, fail nowhere.'"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 1,000,000 special? Because it's easier to write as 1e6. Lazy typing wins."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of drink? Anything with caffeine. Even Red Bull counts as breakfast."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer refuse to skydive? No rollback mechanism if things go wrong."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a message deduplication system's job? To make sure you don't say things twice. To make sure you don't say things twice."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies? Because they can disappear into the hood during meetings."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a junior and principal engineer? Principals break production with confidence."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to law school? To master the art of true or false statements."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of pasta? Spaghetti code. Unfortunately."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the connection timeout so impatient? Because waiting is for synchronous operations."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite factorial? 5! = 120. It's the only one they remember."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate mornings? Because their body runs on async and mornings are blocking."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of weather? Overcast. Perfect screen visibility, no glare."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the throttling mechanism feel mean? Because it literally slowed everyone down."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to cooking? Order delivery. Call it 'importing external dependencies.'"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the health probe so anxious? Because it was constantly being checked."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of joke? One with proper syntax and a clear return value."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love mechanical keyboards? The loud clicks announce they're working. Even when they're not."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a zombie process's biggest problem? It's dead but still taking up resources."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 32 a magical number? Because it's the perfect age... of bits in an integer."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of sandwich? One that doesn't require two hands. Coding efficiency."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate philosophy? Too many undefined behaviors and no compiler to catch them."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a rolling deployment's favorite game? Rolling the dice with production."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love pets? Because pets have better uptime than their services."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a tech debt and a credit card debt? Tech debt has no interest. Wait, it has ALL the interest."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse marriage? Commitment was either true or false, no in-between."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of music for coding? Anything without lyrics. Words are distracting."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the exponential backoff so smart? Because it gave up slowly instead of immediately."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite geometry? Binary trees. They're balanced. Unlike their life."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate shopping malls? Too many dependencies and circular references."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of story? One with proper closure and no memory leaks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the bulkhead pattern feel protective? Because it isolated failures like fire doors."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to socializing? Arrive late, leave early, avoid eye contact."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the eventual consistency so zen? Because it accepted that truth is relative and temporary."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of tree? A red-black tree. Self-balancing, like they wish they were."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love winter sports? Because they can crash without breaking production."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a jitter algorithm's purpose? To add randomness so everything doesn't fail at once. Controlled chaos."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 256 the perfect number? Because it's 2^8 and represents complete possibilities in a byte."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of exercise? Running away from production issues."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate poetry? Too much metaphor, not enough type safety."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a tombstone record's job? To mark what's deleted without actually deleting it. Digital graveyard."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee shops? Free WiFi and acceptable social isolation."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between a warning and an error? About 6 months until production breaks."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer become a minimalist? Too many dependencies ruined their codebase and life."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of chair? One with good lumbar support for 12-hour sessions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the write-ahead log so cautious? Because it logged everything before committing."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite percentage? 99.9% uptime. The other 0.1% is where chaos lives."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate phone calls? Because they interrupt the flow state."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic? Whatever compiles. That's the only logic that matters."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the split-brain scenario feel confused? Because both sides thought they were in charge."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to fitness? Walk to the bathroom. It's between you and the chair."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the quorum consensus so democratic? Because majority rules in distributed systems."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of pet? A debug duck. Silent, supportive, always listening."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love hoodies? Built-in 'do not disturb' mode."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a compensating transaction's job? To undo what can't be undone. Good luck with that."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 404 famous? Because everyone gets lost sometimes."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of joke? One that doesn't need explanation. Like this one. Wait."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate surprises? Because unexpected behavior is never good in code or life."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a linearizable system's motto? 'History is written by the consistent.'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love dark chocolate? It's bitter, like code reviews and production incidents."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between sharding and partitioning? About $100k in consulting fees."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean go to therapy? It had binary thinking and needed to see shades of gray."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of weather forecast? Cloudy. Because cloud computing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the snapshot isolation so precise? Because it captured moments frozen in time."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite binary operation? XOR. It's exclusive and they like that."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate meetings? Because they're synchronous in an async world."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite type of logic puzzle? Sudoku. It's deterministic and satisfying."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the vector clock feel confused? Because time became partial and relative."
  },
  {
    "category": "Coding & Git",
    "joke": "What's the programmer's guide to happiness? Write code. Ship code. Delete code. Repeat."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the read-repair mechanism so helpful? Because it fixed inconsistencies quietly in the background."
  },
  {
    "category": "Logic & Boolean",
    "joke": "What's a programmer's favorite philosophical question? 'Does it compile?' That's the only truth."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love coffee? Because it's the only dependency that actually helps."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a conflict-free replicated data type's superpower? Being eventually consistent without coordination."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why is 9999 scary? Because it's almost 10000 and that means you need another digit."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of book? Technical documentation. Just kidding, nobody reads that."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer hate art? Too subjective. Code is either right or wrong."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's a Paxos consensus algorithm's reputation? Notoriously difficult to understand. Also, it works."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love winter? Less sunlight means more acceptable to stay inside coding."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What's the difference between strong consistency and eventual consistency? About 200ms and a lot of trade-offs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean refuse to compromise? Because there's no such thing as 'maybe' in boolean logic."
  },
  {
    "category": "Coding & Git",
    "joke": "What's a programmer's favorite type of vacation? A digital detox. That never actually happens."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the gossip protocol so chatty? Because spreading rumors is literally its job."
  },
  {
    "category": "Numbers & Bases",
    "joke": "What's a programmer's favorite irrational number? e. Because it's natural and logarithmic."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are 3 kinds of people: Those who can count in ternary, those who can’t, and those who didn’t expect ternary."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers prefer dark mode? Because light attracts bugs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Python programmer go hungry? Because he didn’t import food."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer go to therapy? Too many unresolved exceptions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do Java developers wear glasses? Because they can't C#."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the developer afraid of elevators? Because he couldn’t handle the stack trace."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer’s wife asks him to take out the trash; he gives her a Boolean answer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder get lost? He couldn’t find the main() function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder go broke? He ran out of cache."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer quit his job? He didn’t get arrays."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer cross the road? Because he needed to get to the other IDE."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder get kicked out of school? Because he kept breaking class rules."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers hate nature? It has too many bugs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are 3 kinds of people in the world: Those who can count in ternary, those who can’t, and those who didn’t expect ternary."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers love keyboards?  \n   Because they have all the keys to success."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder go to the beach?  \n   To surf the web."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the database admin go broke?  \n   Too many bad relationships."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer stay calm during a fire?  \n   He used try…catch."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder break up with JavaScript?  \n   Too many callbacks."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers love pizza?  \n   Because it has all the right slices."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer get lost?  \n   He couldn’t find the main() function."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the coder stressed?  \n   Too many threads to manage."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "How do programmers cheer each other up?  \n   They console.log their feelings."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer cross the road?  \n    To get to the other IDE."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the Python programmer go hungry?  \n    Because he didn’t import food."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder love Linux?  \n    Because he loved the terminal."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the database sad?  \n    Too many tables with bad relationships."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers hate bugs?  \n    They always crash the party."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the programmer bring a ladder to work?  \n    To reach the top of the stack."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the developer always carry a notebook?  \n    To keep track of his stack."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the computer go to art school?  \n    To improve its graphics."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the coder get kicked out of school?  \n    He kept breaking class rules."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "What do you call 8 hobbits?  \n    A hobbyte."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are 3 kinds of people:  \n    Those who can count in ternary, those who can’t, and those who didn’t expect ternary."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "There are 3 kinds of people:  \nThose who understand recursion, and those who don’t."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer’s wife says:  \n“Go to the store and buy bread. If they have eggs, buy a dozen.”  \nHe comes back with 12 breads."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers hate nature?  \nToo many bugs."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A programmer’s wife says:  \n“Buy bread. If they have eggs, buy a dozen.”  \nHe returns with 12 breads."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do Java developers wear glasses?  \nBecause they don’t C#."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Schrödinger’s bug:  \nThe code both works and doesn’t until you run it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the AI calm?  \nIt had no emotional dependencies."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A SQL query walks into a bar and asks:  \n“Can I join you?”"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A SQL query walks into a bar and asks:  \n“Can I JOIN you?”"
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Programmer humor is like UDP:  \nNot everyone gets it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Premature optimization is the root of all evil.  \n— still ignored."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do Java developers wear glasses? Because they don’t C#."
  },
  {
    "category": "Coding & Git",
    "joke": "I would tell you a joke about Git… But you might not `merge` it well."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer go broke? Because he used up all his cache."
  },
  {
    "category": "Coding & Git",
    "joke": "A SQL query walks into a bar, walks up to two tables, and asks: 'Can I join you?'"
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the function sad after a breakup? It lost its closure."
  },
  {
    "category": "Coding & Git",
    "joke": "A SQL query walks into a bar, walks up to two tables, and asks: \"Can I join you?\""
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer bring a ladder?  \n   To reach the top of the stack."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git break up with GitHub?  \n   Too many conflicts."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers love version control?  \n   Because it keeps their mistakes documented."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the coder go broke at the restaurant?  \n   He forgot to close his table."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the programmer afraid of the stairs?  \n   He couldn’t handle recursion."
  },
  {
    "category": "Coding & Git",
    "joke": "How do you comfort a JavaScript bug?  \n   Console it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do Python developers wear glasses?  \n   They can’t C without them."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function refuse to work?  \n   It had too many dependencies."
  },
  {
    "category": "Coding & Git",
    "joke": "How do developers fix a broken website?  \n   They Ctrl+Z their mistakes."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the code cold?  \n    Because it left its Windows open."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the developer go broke?  \nBecause he used up all his cache."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate merge conflicts?  \nBecause they always bring up old issues."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git break up with SVN?  \nIt wanted more commitment."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the programmer quit his job?  \nHe didn’t get arrays."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers prefer dark mode?  \nBecause light attracts bugs."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the commit afraid?  \nIt had no message."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the bug cross the road?  \nTo reproduce on the other side."
  },
  {
    "category": "Coding & Git",
    "joke": "Why do programmers hate merge conflicts?  \nBecause they bring up old issues."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the commit scared?  \nIt had no message."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the code always calm?  \nIt was well-indented."
  },
  {
    "category": "Logic & Boolean",
    "joke": "If at first you don’t succeed; call it version 1.0."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer go broke? He lost all his cache."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Programmers don’t die; they just get garbage collected."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers always mix up Christmas and Halloween? Because Oct 31 = Dec 25."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer bring a ladder? Because he wanted to reach the top of the stack."
  },
  {
    "category": "Logic & Boolean",
    "joke": "How many programmers does it take to change a light bulb? None. That’s a hardware problem."
  },
  {
    "category": "Logic & Boolean",
    "joke": "To understand recursion, you must first understand recursion. 2. A Boolean walks into a bar. The bartender asks, \"Do you want a drink?\"  \n   The Boolean replies, \"True.\""
  },
  {
    "category": "Logic & Boolean",
    "joke": "A Boolean walks into a bar. The bartender asks, \"Do you want a drink?\"  \n   The Boolean replies, \"True.\""
  },
  {
    "category": "Logic & Boolean",
    "joke": "How many programmers does it take to change a light bulb?  \n   None. That’s a hardware problem."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer get stuck in the shower?  \n   The instructions said: Lather, Rinse, Repeat."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers prefer dark mode?  \n   Because light attracts bugs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the Boolean unhappy?  \n   Because it always had to choose True or False."
  },
  {
    "category": "Logic & Boolean",
    "joke": "How many programmers does it take to change a light bulb?  \n   None, that’s a hardware problem."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the programmer quit his job?  \n   Because he didn’t get arrays."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the function always sad?  \n   It had too many arguments."
  },
  {
    "category": "Logic & Boolean",
    "joke": "How do programmers celebrate success?  \n   With a logical high-five."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the coder go to therapy?  \n   Too many unresolved exceptions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers hate meetings?  \n   They prefer conditions without side effects."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the developer keep repeating himself?  \n   Recursion, of course."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers always mix up Christmas and Halloween?  \n    Because Oct 31 = Dec 25."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the boolean break up with the integer?  \nIt needed space: true or false."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the logic gate depressed?  \nToo many false inputs."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the AND gate fail the test?  \nIt couldn’t think independently."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the AND gate fail the exam?  \nIt couldn’t think independently."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers love Boolean logic?  \nBecause everything is either right or wrong."
  },
  {
    "category": "Logic & Boolean",
    "joke": "A programmer’s favorite exercise?  \nBoolean squats."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why do programmers love Boolean logic?  \nBecause everything is black or white."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the IF statement stressed?  \nIt had too many conditions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Boolean logic is like life:  \nSometimes true, mostly false."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are only 10 kinds of people: those who understand hexadecimal and those who don’t."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers prefer dark mode? Because light attracts bugs."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the function worried about its type? It didn’t want to lose its class."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why are assembly programmers always soaking wet? They work below C-level."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer write binary jokes? Because he wanted to be funny in ones and zeros."
  },
  {
    "category": "Numbers & Bases",
    "joke": "There are 10 types of people in the world: Those who understand binary, and those who don’t."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers always mix up Halloween and Christmas? Because Oct 31 = Dec 25."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do hexadecimal numbers make bad roommates? Because they’re always high-fiving (0xF)!"
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the computer take a nap?  \n   It had too many bytes."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the computer tired when it got home?  \n   It had a hard drive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers love binary?  \n   It’s as simple as 1, 0."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the integer break up with the float?  \n   Too many decimals."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer go broke?  \n   Because he lost his cache."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why are octal numbers afraid of decimal?  \n   They don’t want to be divided."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the array so sad?  \n   Its indexes were all over the place."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was 6 afraid of 7?  \n   Because 7 8 9… in binary."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do computers make terrible comedians?  \n   They can’t handle negative feedback."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the coder get stuck in base 2?  \n    He couldn’t find the decimal point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do programmers prefer binary?  \nBecause there are only 10 kinds of people."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the coder get stuck in base 2?  \nHe couldn’t find the decimal point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the programmer confused at the bar?  \nHe ordered base 10 but got base 2."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the programmer hate base 8?  \nBecause it doesn’t include 8 or 9."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why do hexadecimal numbers look cool?  \nBecause they start with 0x."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was base 16 always calm?  \nIt could handle all the digits."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number feel lonely?  \nBecause it was NULL."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 10 envy base 2?  \nBecause it was more efficient."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why don’t programmers like fractions?  \nThey’re irrational sometimes."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was 0 invited to every party?  \nIt knew how to stay neutral."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 16 get promoted?  \nIt handled more cases."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number overflow?  \nIt crossed its limits."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the OR gate optimistic?  \nAt least one thing worked."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did NOT feel misunderstood?  \nPeople kept flipping it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was XOR lonely?  \nIt never fit in."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the condition fail?  \nIt wasn’t met."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Boolean logic in real life?  \nIf it works, it’s true."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop break up?  \nIt needed a break."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function feel used?  \nEveryone kept calling it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did GitHub feel crowded?  \nToo many forks."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the variable embarrassed?  \nIt wasn’t initialized."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the code sleep well?  \nNo runtime errors."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Big-O notation is like fame:  \nEveryone ignores constants."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the kernel panic?  \nIt lost control."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the compiler strict?  \nIt hated ambiguity."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the garbage collector relax?  \nEverything was freed."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Concurrency bugs are like ghosts:  \nThey disappear when you look at them."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the binary number feel special?  \nIt was one of a kind."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the IF statement hesitate?  \nIt wasn’t sure about the condition."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the repo feel safe?  \nIt had a good backup branch."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like quantum physics:  \nObserving the problem changes its behavior."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the binary file feel misunderstood?  \nEveryone thought it was just zeros and ones."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why don’t programmers like base 10?  \nIt’s too mainstream."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the condition return false?  \nBecause expectations were too high."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was TRUE jealous of FALSE?  \nFALSE got more attention."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function refuse to work?  \nIt wasn’t in the scope."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the repo go to therapy?  \nToo many unresolved issues."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like archaeology:  \nYou dig through layers to find ancient mistakes."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "The code didn’t fail.  \nIt just successfully demonstrated an unexpected feature."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 2 look so simple?  \nIt had only two sides."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 10 feel superior?  \nBecause it had more digits to show off."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was base 16 always invited?  \nIt brought more color."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number overflow panic?  \nIt exceeded expectations."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did zero stay calm?  \nNothing affected it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the negative number feel down?  \nIt was less than zero."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why don’t programmers trust percentages?  \nThey’re always relative."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did binary break up with decimal?  \nThey couldn’t agree on a point."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the IF statement nervous?  \nToo many outcomes depended on it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did ELSE feel ignored?  \nIt was always the backup plan."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was XOR confused?  \nIt only worked when things were different."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did NOT get blamed?  \nIt flipped the truth."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the condition always late?  \nIt took time to evaluate."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did TRUE feel confident?  \nIt passed every check."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did FALSE fail the interview?  \nToo many failed conditions."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was Boolean logic relaxing?  \nOnly two choices."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop quit?  \nIt was going nowhere."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the variable blush?  \nIt was exposed globally."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the array feel crowded?  \nToo many elements."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function feel important?  \nEveryone depended on it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the program crash?  \nReality didn’t match assumptions."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the commit lie?  \nThe message said ‘minor fix’."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git feel powerful?  \nIt could rewrite history."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the branch feel lonely?  \nNo one merged it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the code review hurt?  \nToo many comments."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like being a detective in a crime movie where you’re also the murderer."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "A computer once beat me at chess.  \nBut it was no match for me at kickboxing."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why do programmers confuse Halloween and Christmas?  \nBecause Oct 31 == Dec 25."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the CPU get tired?  \nToo many cycles."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the RAM stressed?  \nEverything depended on it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the stack feel attacked?  \nSomeone kept popping questions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the heap feel messy?  \nNo clear structure."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the algorithm feel smart?  \nIt scaled well."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was Big-O scary?  \nGrowth got out of control."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the compiler argue?  \nIt took things too literally."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the kernel serious?  \nIt handled core issues."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did multithreading fail?  \nToo many arguments at once."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the deadlock feel awkward?  \nEveryone was waiting."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 3 feel awkward?  \nIt was always caught between binary and decimal."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number refuse to divide?  \nIt didn’t trust fractions."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did binary laugh at decimal?  \nIt only needed two jokes."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was base 16 artistic?  \nIt had more colors to choose from."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did zero never argue?  \nIt had no point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number go out of bounds?  \nIt crossed the array."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the integer feel strong?  \nIt stood on solid ground."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the float feel insecure?  \nIt kept rounding itself."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did IF feel important?  \nEverything depended on it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did ELSE feel ignored?  \nIt was only there when things failed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was XOR dramatic?  \nIt only worked when things were different."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did NOT get blamed?  \nIt flipped the situation."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did TRUE relax?  \nAll checks passed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did FALSE panic?  \nNothing matched expectations."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the condition exhausted?  \nIt was evaluated too often."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop feel trapped?  \nIt had no exit."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the variable feel famous?  \nIt was globally known."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the array feel complete?  \nEvery index was filled."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function feel lonely?  \nNo one ever called it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the code crash?  \nReality disagreed with assumptions."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git feel dangerous?  \nIt could reset everything."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the branch feel hopeful?  \nMaybe it would get merged."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the commit lie again?  \nThe message said ‘temporary fix’."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the code feel clean?  \nIt passed the linter."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like time travel:  \nYou fix the future by changing the past."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the CPU feel dizzy?  \nToo many context switches."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the cache proud?  \nIt was hit constantly."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the stack feel pressured?  \nToo many calls."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was the heap nervous?  \nMemory leaks everywhere."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the scheduler panic?  \nEverything wanted attention."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the thread argue?  \nRace conditions."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was Big-O ignored?  \nConstants looked smaller."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the compiler sigh?  \nAnother warning ignored."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the kernel stay calm?  \nUser problems weren’t its concern."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the deadlock feel eternal?  \nEveryone waited forever."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the algorithm feel superior?  \nIt ran in linear time."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 2 break up with base 10?  \nThey couldn’t find common ground."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number zero feel lonely?  \nBecause no one counted on it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 16 get invited to every party?  \nIt always brought color."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did binary go to therapy?  \nToo many unresolved bits."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the AND gate stressed?  \nIt had too many conditions to meet."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did NOT feel guilty?  \nIt always flipped the truth."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did OR feel hopeful?  \nAt least one condition worked."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git feel dangerous?  \nIt could rewrite history."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the integer go to school?  \nTo become a little more positive."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why was the fraction afraid of decimals?  \nIt felt incomplete."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number overflow?  \nIt couldn’t handle the pressure."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 3 feel odd?  \nIt was stuck in the middle of 2 and 4."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was the IF statement nervous?  \nEverything depended on its decision."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did TRUE feel confident?  \nIt always passed checks."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did FALSE panic?  \nNothing worked out."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did ELSE feel ignored?  \nIt was only needed when things failed."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the commit lie?  \nIt said ‘minor fix’."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function quit?  \nIt had too many calls."
  },
  {
    "category": "Coding & Git",
    "joke": "Why was the code afraid of the debugger?  \nIt didn’t want to be exposed."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the stack feel pressured?  \nToo many calls piled up."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the scheduler panic?  \nAll threads wanted attention at once."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the algorithm feel smart?  \nIt ran in linear time."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the compiler sigh?  \nToo many warnings ignored."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did binary go to school?  \nIt wanted to get a bit smarter."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the negative number feel depressed?  \nIt couldn’t see the positive side."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number line get a promotion?  \nIt always went straight to the point."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did decimal feel insecure?  \nIt was never whole."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did XOR feel complicated?  \nIt only worked when inputs differed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did AND feel responsible?  \nEverything depended on it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why was NOT calm?  \nIt kept flipping truths."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did IF feel important?  \nAll decisions relied on it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop feel endless?  \nIt had no break."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function feel neglected?  \nNo one called it."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like archaeology:  \nYou discover ancient mistakes."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the heap feel chaotic?  \nMemory leaks everywhere."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was Big-O intimidating?  \nGrowth went out of control."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 8 feel incomplete?  \nIt couldn’t find 8 or 9."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did hexadecimal get invited everywhere?  \nIt always brought 0x flair."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did zero feel left out?  \nNothing depended on it."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number line feel stretched?  \nToo many points to cover."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did the IF statement panic?  \nToo many conditions depended on it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did ELSE feel ignored?  \nIt only showed up when everything failed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did TRUE feel proud?  \nIt always passed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did FALSE feel ashamed?  \nNothing ever worked out."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop feel endless?  \nIt forgot to break."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the variable feel exposed?  \nIt was global."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the function feel lonely?  \nNo one called it."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git feel rebellious?  \nIt could reset history."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like detective work:  \nYou’re guilty until proven innocent."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why was Big-O terrifying?  \nGrowth spiraled out of control."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the decimal feel insecure?  \nIt was never whole."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 2 feel lonely?  \nIt had only one friend: 1."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did the number zero feel powerful?  \nIt could multiply anything to nothing."
  },
  {
    "category": "Numbers & Bases",
    "joke": "Why did base 16 feel superior?  \nIt had more digits to play with."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did AND feel stressed?  \nAll conditions depended on it."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did XOR feel dramatic?  \nIt only worked when inputs differed."
  },
  {
    "category": "Logic & Boolean",
    "joke": "Why did TRUE feel confident?  \nIt always passed tests."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the loop feel trapped?  \nIt forgot to break."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did the variable feel shy?  \nIt was declared private."
  },
  {
    "category": "Coding & Git",
    "joke": "Why did Git feel rebellious?  \nIt could rewrite history."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Debugging is like archaeology:  \nYou dig through layers of past mistakes."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did the CPU feel tired?  \nToo many cycles."
  },
  {
    "category": "Advanced Nerdy",
    "joke": "Why did Big-O look scary?  \nGrowth got out of control."
  }
]